Revit 2027 API
BuiltInFailures.RebarCouplerFailures.DistanceBetweenBarsWarning Property
 This is used to post warning. The distance between the connected ends of the bars exceeds 10 bar diameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DistanceBetweenBarsWarning { get; }
Public Shared ReadOnly Property DistanceBetweenBarsWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DistanceBetweenBarsWarning {
	FailureDefinitionId^ get ();
}
static member DistanceBetweenBarsWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace